tests/results/results_extreme_high_load.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: tests/loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 0089/1000 VUs, 28 complete and 0 interrupted iterations
default   [   2% ] 0089/1000 VUs  00.9s/50.0s

running (0m01.9s), 0189/1000 VUs, 203 complete and 0 interrupted iterations
default   [   4% ] 0189/1000 VUs  01.9s/50.0s

running (0m02.9s), 0289/1000 VUs, 551 complete and 0 interrupted iterations
default   [   6% ] 0289/1000 VUs  02.9s/50.0s

running (0m03.9s), 0388/1000 VUs, 1046 complete and 0 interrupted iterations
default   [   8% ] 0388/1000 VUs  03.9s/50.0s

running (0m04.9s), 0488/1000 VUs, 1536 complete and 0 interrupted iterations
default   [  10% ] 0488/1000 VUs  04.9s/50.0s

running (0m05.9s), 0588/1000 VUs, 2063 complete and 0 interrupted iterations
default   [  12% ] 0588/1000 VUs  05.9s/50.0s

running (0m06.9s), 0688/1000 VUs, 2544 complete and 0 interrupted iterations
default   [  14% ] 0688/1000 VUs  06.9s/50.0s

running (0m07.9s), 0788/1000 VUs, 3027 complete and 0 interrupted iterations
default   [  16% ] 0788/1000 VUs  07.9s/50.0s

running (0m08.9s), 0888/1000 VUs, 3506 complete and 0 interrupted iterations
default   [  18% ] 0888/1000 VUs  08.9s/50.0s

running (0m09.9s), 0988/1000 VUs, 3944 complete and 0 interrupted iterations
default   [  20% ] 0988/1000 VUs  09.9s/50.0s

running (0m10.9s), 1000/1000 VUs, 4425 complete and 0 interrupted iterations
default   [  22% ] 1000/1000 VUs  10.9s/50.0s

running (0m11.9s), 1000/1000 VUs, 4980 complete and 0 interrupted iterations
default   [  24% ] 1000/1000 VUs  11.9s/50.0s

running (0m12.9s), 1000/1000 VUs, 5426 complete and 0 interrupted iterations
default   [  26% ] 1000/1000 VUs  12.9s/50.0s

running (0m13.9s), 1000/1000 VUs, 5880 complete and 0 interrupted iterations
default   [  28% ] 1000/1000 VUs  13.9s/50.0s

running (0m14.9s), 1000/1000 VUs, 6326 complete and 0 interrupted iterations
default   [  30% ] 1000/1000 VUs  14.9s/50.0s

running (0m15.9s), 1000/1000 VUs, 6763 complete and 0 interrupted iterations
default   [  32% ] 1000/1000 VUs  15.9s/50.0s

running (0m16.9s), 1000/1000 VUs, 7260 complete and 0 interrupted iterations
default   [  34% ] 1000/1000 VUs  16.9s/50.0s

running (0m17.9s), 1000/1000 VUs, 7657 complete and 0 interrupted iterations
default   [  36% ] 1000/1000 VUs  17.9s/50.0s

running (0m18.9s), 1000/1000 VUs, 8075 complete and 0 interrupted iterations
default   [  38% ] 1000/1000 VUs  18.9s/50.0s

running (0m19.9s), 1000/1000 VUs, 8578 complete and 0 interrupted iterations
default   [  40% ] 1000/1000 VUs  19.9s/50.0s

running (0m20.9s), 1000/1000 VUs, 9130 complete and 0 interrupted iterations
default   [  42% ] 1000/1000 VUs  20.9s/50.0s

running (0m21.9s), 1000/1000 VUs, 9504 complete and 0 interrupted iterations
default   [  44% ] 1000/1000 VUs  21.9s/50.0s

running (0m22.9s), 1000/1000 VUs, 9891 complete and 0 interrupted iterations
default   [  46% ] 1000/1000 VUs  22.9s/50.0s

running (0m23.9s), 1000/1000 VUs, 10197 complete and 0 interrupted iterations
default   [  48% ] 1000/1000 VUs  23.9s/50.0s

running (0m24.9s), 1000/1000 VUs, 10667 complete and 0 interrupted iterations
default   [  50% ] 1000/1000 VUs  24.9s/50.0s

running (0m25.9s), 1000/1000 VUs, 11141 complete and 0 interrupted iterations
default   [  52% ] 1000/1000 VUs  25.9s/50.0s

running (0m26.9s), 1000/1000 VUs, 11685 complete and 0 interrupted iterations
default   [  54% ] 1000/1000 VUs  26.9s/50.0s

running (0m27.9s), 1000/1000 VUs, 12059 complete and 0 interrupted iterations
default   [  56% ] 1000/1000 VUs  27.9s/50.0s

running (0m28.9s), 1000/1000 VUs, 12452 complete and 0 interrupted iterations
default   [  58% ] 1000/1000 VUs  28.9s/50.0s

running (0m29.9s), 1000/1000 VUs, 12841 complete and 0 interrupted iterations
default   [  60% ] 1000/1000 VUs  29.9s/50.0s

running (0m30.9s), 1000/1000 VUs, 13220 complete and 0 interrupted iterations
default   [  62% ] 1000/1000 VUs  30.9s/50.0s

running (0m31.9s), 1000/1000 VUs, 13631 complete and 0 interrupted iterations
default   [  64% ] 1000/1000 VUs  31.9s/50.0s

running (0m32.9s), 1000/1000 VUs, 14056 complete and 0 interrupted iterations
default   [  66% ] 1000/1000 VUs  32.9s/50.0s

running (0m33.9s), 1000/1000 VUs, 14465 complete and 0 interrupted iterations
default   [  68% ] 1000/1000 VUs  33.9s/50.0s

running (0m34.9s), 1000/1000 VUs, 14982 complete and 0 interrupted iterations
default   [  70% ] 1000/1000 VUs  34.9s/50.0s

running (0m35.9s), 1000/1000 VUs, 15484 complete and 0 interrupted iterations
default   [  72% ] 1000/1000 VUs  35.9s/50.0s

running (0m36.9s), 1000/1000 VUs, 16202 complete and 0 interrupted iterations
default   [  74% ] 1000/1000 VUs  36.9s/50.0s

running (0m37.9s), 1000/1000 VUs, 16671 complete and 0 interrupted iterations
default   [  76% ] 1000/1000 VUs  37.9s/50.0s

running (0m38.9s), 1000/1000 VUs, 17111 complete and 0 interrupted iterations
default   [  78% ] 1000/1000 VUs  38.9s/50.0s

running (0m39.9s), 1000/1000 VUs, 17507 complete and 0 interrupted iterations
default   [  80% ] 1000/1000 VUs  39.9s/50.0s

running (0m40.9s), 0984/1000 VUs, 17904 complete and 0 interrupted iterations
default   [  82% ] 0984/1000 VUs  40.9s/50.0s

running (0m41.9s), 0925/1000 VUs, 18428 complete and 0 interrupted iterations
default   [  84% ] 0925/1000 VUs  41.9s/50.0s

running (0m43.0s), 0806/1000 VUs, 18979 complete and 0 interrupted iterations
default   [  86% ] 0806/1000 VUs  42.9s/50.0s

running (0m43.9s), 0712/1000 VUs, 19404 complete and 0 interrupted iterations
default   [  88% ] 0712/1000 VUs  43.9s/50.0s

running (0m44.9s), 0590/1000 VUs, 19902 complete and 0 interrupted iterations
default   [  90% ] 0590/1000 VUs  44.9s/50.0s

running (0m45.9s), 0453/1000 VUs, 20468 complete and 0 interrupted iterations
default   [  92% ] 0453/1000 VUs  45.9s/50.0s

running (0m46.9s), 0355/1000 VUs, 21008 complete and 0 interrupted iterations
default   [  94% ] 0355/1000 VUs  46.9s/50.0s

running (0m47.9s), 0248/1000 VUs, 21501 complete and 0 interrupted iterations
default   [  96% ] 0248/1000 VUs  47.9s/50.0s

running (0m48.9s), 0140/1000 VUs, 21873 complete and 0 interrupted iterations
default   [  98% ] 0140/1000 VUs  48.9s/50.0s

running (0m49.9s), 0044/1000 VUs, 22081 complete and 0 interrupted iterations
default   [ 100% ] 0044/1000 VUs  49.9s/50.0s

     ✗ status is 200
      ↳  99% — ✓ 22123 / ✗ 4

     █ setup

     checks.........................: 99.98%  ✓ 22123        ✗ 4     
     data_received..................: 2.0 GB  40 MB/s
     data_sent......................: 16 MB   315 kB/s
     http_req_blocked...............: avg=113.2µs  min=1.08µs   med=6.29µs   max=80.86ms  p(90)=24.25µs  p(95)=121.04µs
     http_req_connecting............: avg=80.39µs  min=0s       med=0s       max=80.66ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=51.74ms  min=381.2µs  med=25.55ms  max=4.4s     p(90)=79.58ms  p(95)=124.2ms 
       { expected_response:true }...: avg=51.74ms  min=381.2µs  med=25.55ms  max=4.4s     p(90)=79.58ms  p(95)=124.22ms
     http_req_failed................: 0.01%   ✓ 4            ✗ 22125 
     http_req_receiving.............: avg=813.16µs min=20.12µs  med=158.2µs  max=194.34ms p(90)=1.2ms    p(95)=2.8ms   
     http_req_sending...............: avg=361.72µs min=4.16µs   med=22.58µs  max=199.94ms p(90)=165.74µs p(95)=584.69µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=50.56ms  min=267.41µs med=24.76ms  max=4.4s     p(90)=76.21ms  p(95)=120.95ms
     http_reqs......................: 22129   437.154614/s
     iteration_duration.............: avg=1.83s    min=25.41ms  med=1.63s    max=21.37s   p(90)=2.88s    p(95)=3.74s   
     iterations.....................: 22127   437.115104/s
     vus............................: 44      min=44         max=1000
     vus_max........................: 1000    min=1000       max=1000
     ws_connecting..................: avg=1.15s    min=309.66µs med=961.83ms max=20.66s   p(90)=2.2s     p(95)=3.07s   
     ws_msgs_received...............: 5135406 101449.06806/s
     ws_msgs_sent...................: 22121   436.996575/s
     ws_session_duration............: avg=1.67s    min=500.52ms med=1.48s    max=21.19s   p(90)=2.71s    p(95)=3.59s   
     ws_sessions....................: 22127   437.115104/s


running (0m50.6s), 0000/1000 VUs, 22127 complete and 0 interrupted iterations
default ✓ [ 100% ] 0000/1000 VUs  50s